renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx26t/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB20;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB21;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB22;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB23;
	char           wk10[416];
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB24;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB25;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB26;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB27;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB28;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB29;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB30;
	struct {
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ID : 29;
			unsigned long  : 1;
			unsigned long RTR : 1;
			unsigned long IDE : 1;
#else
			unsigned long IDE : 1;
			unsigned long RTR : 1;
			unsigned long  : 1;
			unsigned long ID : 29;
#endif
	} BIT;
		} HF0;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TS : 16;
			unsigned long  : 12;
			unsigned long DLC : 4;
#else
			unsigned long DLC : 4;
			unsigned long  : 12;
			unsigned long TS : 16;
#endif
	} BIT;
		} HF1;
		union {
			unsigned long LONG;
			struct {
				unsigned short L;
				unsigned short H;
			} WORD;
			struct {
				unsigned char LL;
				unsigned char LH;
				unsigned char HL;
				unsigned char HH;
			} BYTE;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ESI : 1;
			unsigned long BRS : 1;
			unsigned long FDF : 1;
			unsigned long  : 5;
			unsigned long IFL : 2;
			unsigned long  : 6;
			unsigned long PTR : 16;
#else
			unsigned long PTR : 16;
			unsigned long  : 6;
			unsigned long IFL : 2;
			unsigned long  : 5;
			unsigned long FDF : 1;
			unsigned long BRS : 1;
			unsigned long ESI : 1;
#endif
	} BIT;
		} HF2;
		union {
			unsigned long DF[16];
			unsigned char DATA[64];
		};
	} RMB31;
	char           wk11[276608];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ECEF : 1;
			unsigned long EC1EF : 1;
			unsigned long EC2EF : 1;
			unsigned long EC1EIE : 1;
			unsigned long EC2EIE : 1;
			unsigned long EC1ECD : 1;
			unsigned long ECEDE : 1;
			unsigned long  : 2;
			unsigned long EC1EC : 1;
			unsigned long EC2EC : 1;
			unsigned long ECOVF : 1;
			unsigned long  : 2;
			unsigned long ECEDWC : 2;
			unsigned long EC1EAS : 1;
			unsigned long EC2EAS : 1;
			unsigned long  : 14;
#else
			unsigned long  : 14;
			unsigned long EC2EAS : 1;
			unsigned long EC1EAS : 1;
			unsigned long ECEDWC : 2;
			unsigned long  : 2;
			unsigned long ECOVF : 1;
			unsigned long EC2EC : 1;
			unsigned long EC1EC : 1;
			unsigned long  : 2;
			unsigned long ECEDE : 1;
			unsigned long EC1ECD : 1;
			unsigned long EC2EIE : 1;
			unsigned long EC1EIE : 1;
			unsigned long EC2EF : 1;
			unsigned long EC1EF : 1;
			unsigned long ECEF : 1;
#endif
	} BIT;
	} ECCSR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 1;
			unsigned short ECDIS : 1;
			unsigned short  : 5;
			unsigned short ECTME : 1;
			unsigned short  : 6;
			unsigned short ECTMWC : 2;
#else
			unsigned short ECTMWC : 2;
			unsigned short  : 6;
			unsigned short ECTME : 1;
			unsigned short  : 5;
			unsigned short ECDIS : 1;
			unsigned short  : 1;
#endif
	} BIT;
	} ECTMR;
	char           wk12[6];
	unsigned long  ECTDR;
	unsigned long  ECEAR;
} st_canfd_t;

typedef struct st_canfd0 {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BRP : 10;
			unsigned long SJW : 7;
			unsigned long TSEG1 : 8;
			unsigned long TSEG2 : 7;
#else
			unsigned long TSEG2 : 7;
			unsigned long TSEG1 : 8;
			unsigned long SJW : 7;
			unsigned long BRP : 10;
#endif
	} BIT;
	} NBCR;
	union {
		unsigned long LONG;
		struct {
			
