renesas/rx-driver-package/source/r_bsp/r_bsp_vx.xx/r_bsp/mcu/rx26t/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDC : 2;
			unsigned long SLPRQ : 1;
			unsigned long RTBO : 1;
			unsigned long  : 4;
			unsigned long BEIE : 1;
			unsigned long EWIE : 1;
			unsigned long EPIE : 1;
			unsigned long BOEIE : 1;
			unsigned long BORIE : 1;
			unsigned long OLIE : 1;
			unsigned long BLIE : 1;
			unsigned long ALIE : 1;
			unsigned long TAIE : 1;
			unsigned long ECOVIE : 1;
			unsigned long SCOVIE : 1;
			unsigned long TDCVIE : 1;
			unsigned long  : 1;
			unsigned long BOM : 2;
			unsigned long EDM : 1;
			unsigned long CTME : 1;
			unsigned long CTMS : 2;
			unsigned long  : 3;
			unsigned long BFT : 1;
			unsigned long ROME : 1;
#else
			unsigned long ROME : 1;
			unsigned long BFT : 1;
			unsigned long  : 3;
			unsigned long CTMS : 2;
			unsigned long CTME : 1;
			unsigned long EDM : 1;
			unsigned long BOM : 2;
			unsigned long  : 1;
			unsigned long TDCVIE : 1;
			unsigned long SCOVIE : 1;
			unsigned long ECOVIE : 1;
			unsigned long TAIE : 1;
			unsigned long ALIE : 1;
			unsigned long BLIE : 1;
			unsigned long OLIE : 1;
			unsigned long BORIE : 1;
			unsigned long BOEIE : 1;
			unsigned long EPIE : 1;
			unsigned long EWIE : 1;
			unsigned long BEIE : 1;
			unsigned long  : 4;
			unsigned long RTBO : 1;
			unsigned long SLPRQ : 1;
			unsigned long MDC : 2;
#endif
	} BIT;
	} CHCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RSTST : 1;
			unsigned long HLTST : 1;
			unsigned long SLPST : 1;
			unsigned long EPST : 1;
			unsigned long BOST : 1;
			unsigned long TRMST : 1;
			unsigned long RECST : 1;
			unsigned long CRDY : 1;
			unsigned long RESI : 1;
			unsigned long  : 7;
			unsigned long REC : 8;
			unsigned long TEC : 8;
#else
			unsigned long TEC : 8;
			unsigned long REC : 8;
			unsigned long  : 7;
			unsigned long RESI : 1;
			unsigned long CRDY : 1;
			unsigned long RECST : 1;
			unsigned long TRMST : 1;
			unsigned long BOST : 1;
			unsigned long EPST : 1;
			unsigned long SLPST : 1;
			unsigned long HLTST : 1;
			unsigned long RSTST : 1;
#endif
	} BIT;
	} CHSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BEDF : 1;
			unsigned long EWDF : 1;
			unsigned long EPDF : 1;
			unsigned long BOEDF : 1;
			unsigned long BORDF : 1;
			unsigned long OLDF : 1;
			unsigned long BLDF : 1;
			unsigned long ALDF : 1;
			unsigned long SEDF : 1;
			unsigned long FEDF : 1;
			unsigned long AEDF : 1;
			unsigned long CEDF : 1;
			unsigned long B1EDF : 1;
			unsigned long B0EDF : 1;
			unsigned long ADEDF : 1;
			unsigned long  : 1;
			unsigned long CRC15 : 15;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long CRC15 : 15;
			unsigned long  : 1;
			unsigned long ADEDF : 1;
			unsigned long B0EDF : 1;
			unsigned long B1EDF : 1;
			unsigned long CEDF : 1;
			unsigned long AEDF : 1;
			unsigned long FEDF : 1;
			unsigned long SEDF : 1;
			unsigned long ALDF : 1;
			unsigned long BLDF : 1;
			unsigned long OLDF : 1;
			unsigned long BORDF : 1;
			unsigned long BOEDF : 1;
			unsigned long EPDF : 1;
			unsigned long EWDF : 1;
			unsigned long BEDF : 1;
#endif
	} BIT;
	} CHESR;
	char           wk0[124];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TQE : 1;
			unsigned long  : 4;
			unsigned long TQIE : 1;
			unsigned long  : 1;
			unsigned long TQIM : 1;
			unsigned long QDS : 2;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long QDS : 2;
			unsigned long TQIM : 1;
			unsigned long  : 1;
			unsigned long TQIE : 1;
			unsigned long  : 4;
			unsigned long TQE : 1;
#endif
	} BIT;
	} TQCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EMPTY : 1;
			unsigned long FULL : 1;
			unsigned long TQIF : 1;
			unsigned long  : 5;
			unsigned long FLVL : 3;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long FLVL : 3;
			unsigned long  : 5;
			unsigned long TQIF : 1;
			unsigned long FULL : 1;
			unsigned long EMPTY : 1;
#endif
	} BIT;
	} TQSR0;
	unsigned long  TQPCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long THE : 1;
			unsigned long  : 7;
			unsigned long THIE : 1;
			unsigned long THIM : 1;
			unsigned long THRC : 1;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long THRC : 1;
			unsigned long THIM : 1;
			unsigned long THIE : 1;
			unsigned long  : 7;
			unsigned long THE : 1;
#endif
	} BIT;
	} THCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EMPTY : 1;
			unsigned long FULL : 1;
			unsigned long LOST : 1;
			unsigned long THIF : 1;
			unsigned long  : 4;
			unsigned long FLVL : 4;
			unsigned long  : 20;
#else
			unsigned long  : 20;
			unsigned long FLVL : 4;
			unsigned long  : 4;
			unsigned long THIF : 1;
			unsigned long LOST : 1;
			unsigned long FULL : 1;
			unsigned long EMPTY : 1;
#endif
	} BIT;
	} THSR;
	unsigned long  THPCR;
	char           wk1[92];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BRP : 8;
			unsigned long TSEG1 : 5;
			unsigned long  : 3;
			unsigned long TSEG2 : 4;
			unsigned long  : 4;
			unsigned long SJW : 4;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long SJW : 4;
			unsigned long  : 4;
			unsigned long TSEG2 : 4;
			unsigned long  : 3;
			unsigned long TSEG1 : 5;
			unsigned long BRP : 8;
#endif
	} BIT;
	} DBCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ECC : 3;
			unsigned long  : 5;
			unsigned long SSPC : 1;
			unsigned long TDCE : 1;
			unsigned long TESI : 1;
			unsigned long  : 5;
			unsigned long TDCO : 8;
			unsigned long  : 4;
			unsigned long FDOE : 1;
			unsigned long REFE : 1;
			unsigned long CLOE : 1;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long CLOE : 1;
			unsigned long REFE : 1;
			unsigned long FDOE : 1;
			unsigned long  : 4;
			unsigned long TDCO : 8;
			unsigned long  : 5;
			unsigned long TESI : 1;
			unsigned long TDCE : 1;
			unsigned long SSPC : 1;
			unsigned long  : 5;
			unsigned long ECC : 3;
#endif
	} BIT;
	} FDCFG;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ECCL : 1;
			unsigned long SCCL : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long SCCL : 1;
			unsigned long ECCL : 1;
#endif
	} BIT;
	} FDCTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDCR : 8;
			unsigned long ECOV : 1;
			unsigned long SCOV : 1;
			unsigned long  : 5;
			unsigned long TDCV : 1;
			unsigned long EC : 8;
			unsigned long SC : 8;
#else
			unsigned long SC : 8;
			unsigned long EC : 8;
			unsigned long TDCV : 1;
			unsigned long  : 5;
			unsigned long SCOV : 1;
			unsigned long ECOV : 1;
			unsigned long TDCR : 8;
#endif
	} BIT;
	} FDSTS;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CRC21 : 21;
			unsigned long  : 3;
			unsigned long SBC : 4;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long SBC : 4;
			unsigned long  : 3;
			unsigned long CRC21 : 21;
#endif
	} BIT;
	} FDCRC;
	char           wk2[1580];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BT : 3;
			unsigned long BN : 2;
			unsigned long  : 11;
			unsigned long TS : 16;
#else
			unsigned long TS : 16;
			unsigned long  : 11;
			unsigned long BN : 2;
			unsigned long BT : 3;
#endif
	} BIT;
	} THACR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PTR : 16;
			unsigned long IFL : 2;
			unsigned long  : 14;
#else
			unsigned long  : 14;
			unsigned long IFL : 2;
			unsigned long PTR : 16;
#endif
	} BIT;
	} THACR1;
} st_canfd0_t;

typedef struct st_cmpc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CINV : 1;
			unsigned char COE : 1;
			unsigned char  : 1;
			unsigned char CEG : 2;
			unsigned char CDFS : 2;
			unsigned char HCMPON : 1;
#else
			unsigned char HCMPON : 1;
			unsigned char CDFS : 2;
			unsigned char CEG : 2;
			unsigned char  : 1;
			unsigned char COE : 1;
			unsigned char CINV : 1;
#endif
	} BIT;
	} CMPCTL;
	char           wk0[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMPSEL : 4;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char CMPSEL : 4;
#endif
	} BIT;
	} CMPSEL0;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CVRS : 4;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char CVRS : 4;
#endif
	} BIT;
	} CMPSEL1;
	char           wk2[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CMPMON0 : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char CMPMON0 : 1;
#endif
	} BIT;
	} CMPMON;
	char           wk3[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CPOE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char CPOE : 1;
#endif
	} BIT;
	} CMPIOC;
	char           wk4[7];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CNFS : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char CNFS : 1;
#endif
	} BIT;
	} CMPCTL2;
} st_cmpc_t;

typedef struct st_cmt {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short STR0 : 1;
			unsigned short STR1 : 1;
			unsigned short  : 14;
#else
			unsigned short  : 14;
			unsigned short STR1 : 1;
			unsigned short STR0 : 1;
#endif
	} BIT;
	} CMSTR0;
	char           wk0[14];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short STR2 : 1;
			unsigned short STR3 : 1;
			unsigned short  : 14;
#else
			unsigned short  : 14;
			unsigned short STR3 : 1;
			unsigned short STR2 : 1;
#endif
	} BIT;
	} CMSTR1;
} st_cmt_t;

